{
  "title": "À propos de moi",
  "p1": "Hé, je suis Milad. Je suis développeur, étudiant, mentor et écrivain de 23 ans!",
  "p2": "Je travaille chez Arsh Co. en tant que responsable de l'équipe de développement front-end.",
  "p3": "J'ai grandi à Shahr-e-Rey, un district du sud de l'État de Téhéran.",
  "p4": "Après avoir passé mon école primaire et secondaire, j'ai été accepté pour NODET et j'y ai passé mon lycée.",
  "p5": "Après avoir été classé 697 à l'examen d'entrée national, j'ai été accepté pour étudier le génie électrique à l'Université Shahid Beheshti",
  "p6": "Je ne me sentais vraiment pas bien d'être ingénieur électricien et après quelques semestres, j'ai changé de domaine pour le génie informatique et jusque-là, je travaille comme développeur et j'en profite.",
  "p7": "Je passe mon temps libre à lire, écouter des musiques, regarder des émissions de télévision et passer du temps avec mes amis proches.",
  "timeline": {
    "title": "Chronologie",
    "born": "né",
    "born_desc": "Né et élevé comme un enfant unique... ",
    "earlySchool": "École précoce",
    "earlySchool_desc": "quand j'avais 4 ans, j'ai passé un test pour voir si je suis prêt pour l'école et je l'ai réussi! mais j'étais encore plus petit que les enfants de mon âge, alors mes parents ont décidé que je m'en tenais à la routine.",
    "startingSchool": "Commencer l'école",
    "startingSchool_desc": "Rien de spatial à dire à ce sujet, comme tous les autres enfants iraniens, je suis allé dans une école sous un système qui tue la créativité et le bonheur des élèves.",
    "firstComputer": "Premier ordinateur",
    "firstComputer_desc": "Mon père a acheté un ordinateur pour mes 10 ans, Whoa!",
    "choosingNationalExamPath": "Choisir le chemin de l'examen d'entrée national",
    "choosingNationalExamPath_desc": "J'étais désespérément amoureux des mathématiques, j'ai toujours rêvé que ma version de 40 ans soit un professeur maigre et chauve qui déteste les enfants, mais après avoir mis tous mes efforts et mon amour pour l'apprendre, j'ai décidé de me concentrer sur l'examen d'entrée national.",
    "university": "Université",
    "university_desc": "L'effort a porté ses fruits ! J'ai été accepté pour étudier le génie électrique à l'université Shahid Beheshti, je ne pouvais pas être plus heureux mais...",
    "tookCoupleOfSemestersOff": "J'ai enlevé Quelques Semestres",
    "tookCoupleOfSemestersOff_desc": "J'ai pris deux semestres de congé pour me concentrer sur l'étude de la programmation et aussi parce que je n'étais pas dans une situation mentale vraiment mauvaise.",
    "changingField": "Changer de champ",
    "changingField_desc": "Après un an de flip-flopping, j'ai décidé de changer de domaine d'études en génie informatique. Je ne peux pas oublier l'enfer que mes parents ont élevé à cause de la décision.",
    "firstDayAtWork": "Premier Jour Au Travail",
    "firstDayAtWork_desc": "En tant qu'oiseau de nuit, j'avais une raison ferme de détester ce jour et les jours à venir, mais mon amour pour l'apprentissage et la compétition m'a aidé à continuer.",
    "growingMyHair": "C'est à ce moment que j'ai commencé à faire pousser mes cheveux :)",
    "growingMyHair_desc": "",
    "leftMyFirstJob": "J'Ai Quitté Mon Premier Emploi",
    "leftMyFirstJob_desc": "Au fil du temps, j'ai réalisé que ce n'était vraiment rien à apprendre pour moi dans cette entreprise, alors j'ai officiellement quitté mon premier emploi",
    "startingAtAppTech": "Commencer À AppTech",
    "startingAtAppTech_desc": "J'ai trouvé une bonne entreprise pour relever de nouveaux défis. J'ai amélioré mes connaissances sur React là-dedans et j'ai appris React Native.",
    "startingAtArshCo": "À Partir De Arsh Co.",
    "startingAtArshCo_desc": "Après avoir acquis une bonne connaissance de React, j'ai décidé de relever un nouveau défi et de travailler sur des projets plus importants et j'ai choisi Arsh Company pour continuer. malgré mes derniers supérieurs, ils étaient vraiment gentils avec moi",
    "becomingChapterLead": "Devenir Chef d'équipe",
    "becomingChapterLead_desc": "J'ai fait mes preuves au siège dans mes défis et je suis devenu responsable de l'équipe de développement front-end.",
    "ielts": "IELTS",
    "ielts_desc": "J'ai réussi mon examen IELTS avec un score de 7."
  },
  "workExperience": {
    "title": "Expérience professionnelle",
    "1": "Développeur Web Front-End",
    "1_desc": "Freelance - Téhéran",
    "2": "Développeur Web Front-End",
    "2_desc": "Silverpath - Téhéran",
    "3": "Développeur Web Front-End",
    "3_desc": "App Tech - Téhéran",
    "4": "Responsable de l'équipe de développement Web Front End",
    "4_desc": "Arsh - Téhéran"
  },
  "education": {
    "title": "Éducation",
    "1": "Génie électrique",
    "1_desc": "Université Shahid Beheshti, GPA : B",
    "2": "Génie informatique",
    "2_desc": "Université islamique d'Azad, GPA : A+"
  }
}
