{
  "title": "Projets",
  "points": "Points",
  "tools": "Tools",
  "gallery": "Galerie",
  "nthImage": "Image {{n}}",
  "octava": {
    "name": "Octava",
    "description": "Plateforme de streaming de musique persane",
    "points": {
      "1": "Chargement de page ultra rapide avec régénération statique incrémentale (ISR)",
      "2": "Couche de transport client-serveur supplémentaire avec proxy http",
      "2-1": "Enregistrement du jeton d'autorisation en tant que cookie http uniquement",
      "2-2": "Passez chaque api via le proxy http et ajoutez un jeton à l'en-tête",
      "2-3": "De cette façon, l'accès au jeton est beaucoup plus difficile pour les utilisateurs malveillants (pas impossible bien sûr)",
      "2-4": "Cette méthode permet de faire des choses plus intéressantes et utiles comme:",
      "2-4-1": "Masquer Une Adresse IP",
      "2-4-2": "Filtrage des demandes",
      "2-4-3": "Protection Et Sécurité",
      "2-4-4": "etc.",
      "3": "Infrastructure multilingue et thématique",
      "3-1": "Premier site web multilingue SEO",
      "3-2": "Site Web rendu côté serveur multidirectionnel",
      "3-3": "Pas de changement de thème flash",
      "3-4": "Définir des thèmes personnalisés",
      "4": "Intervalles de revalidation des données côté client",
      "5": "Considérer les meilleures pratiques de référencement",
      "5-1": "Optimisation des balises meta",
      "5-2": "Définir des balises canoniques pour éviter les doublons de contenu",
      "5-3": "Ajout d'une balise de schéma (résultat riche) pour les médias, la chapelure, ...",
      "6": "Mise en cache côté client",
      "6-1": "Cache first - Stratégie de secours du réseau pour la mise en page, les polices, les logos, les avatars et d'autres données importantes",
      "6-2": "Lecture des données importantes du cache et en cas d'échec du repli sur le réseau",
      "6-3": "Rendu d'une connexion réseau sans connexion pour les cas de connexion réseau complètement désactivés",
      "7": "Chargement d'image plus rapide et plus convivial avec la méthode d'optimisation d'image",
      "7-1": "Charger des images en fonction des dimensions de l'image et économiser beaucoup de données et de temps",
      "7-2": "Afficher une version floue de l'image au début pour rendre l'attente d'images plus grandes beaucoup plus agréable",
      "7-3": "Affichage d'une animation scintillante pour des images inconnues qui ne peuvent pas être floues",
      "8": " Codage sécurisé avec contrôles de sécurité frontaux",
      "9": "Expérience utilisateur de l'application mobile pour les utilisateurs de PWA en utilisant des composants natifs mobiles tels que la feuille inférieure, le navigateur des onglets inférieurs et..."
    }
  },
  "uneed": {
    "name": "Uneed",
    "description": "Une plate-forme de publication gratuite de publicités et de demandes de renseignements concernant l'achat et la vente de produits neufs et d'occasion.",
    "points": {
      "1": "Utiliser Ensuite.framework js pour le rendu côté serveur ",
      "2": "Suivre les principes du Micro Frontend",
      "3": "Localisation et internationalisation",
      "4": "Utiliser redux saga comme middleware asynchrone redux",
      "5": "Combinaison socket.io et redux pour créer un chat collant flottant en bas de la mise en page et une page de chat."
    }
  },
  "tarinoo": {
    "name": "Tarinoo",
    "description": "Un autre produit de l'infrastructure uneed, conçu pour vendre des sites Web entièrement personnalisés aux utilisateurs de type entreprise.",
    "points": {
      "1": "Écrire du code une fois et l'utiliser dans d'autres sites avec 4 thèmes différents (jusqu'à présent)",
      "2": "Contrôle total sur les détails du produit, les bannières, le contenu et..., comme WordPress ou Joomla."
    }
  },
  "bityon": {
    "name": "Bityon",
    "description": "Une plate-forme sécurisée pour acheter et vendre du bitcoin et d'autres monnaies cryptographiques.",
    "points": {
      "1": "Infrastructure multilingue et thématique",
      "1-1": "Premier site web multilingue SEO",
      "1-2": "Site Web rendu côté serveur multidirectionnel",
      "1-3": "Pas de changement de thème flash",
      "1-4": "Définir des thèmes personnalisés",
      "2": "Utilisation de l'API Contextuelle pour la gestion des états (pour les données qui ne changent pas fréquemment pour causer des problèmes de performances)",
      "3": "Remplacer formik par react-hook-form pour de meilleures performances."
    }
  },
  "biz": {
    "name": "BIZ",
    "description": "La plus grande société de marketing de réseau iranienne.",
    "points": {
      "1": "Implémentation SSR personnalisée",
      "2-1": "Rendu manuel côté serveur avec express",
      "2-2": "Prise en charge des redux côté serveur et côté client avec état redux isomorphe synchronisé",
      "2-3": "Pré-extraction et transmission des données SSR aux pages en tant qu'accessoires",
      "3": "Requêtes de mise en cache avec une base de données de paires clé-valeur Redis",
      "4": "Notifications avec firebase"
    }
  },
  "crm": {
    "name": "Panneau CRM",
    "description": "Panneau de gestion de la relation client qui fournit un outil de gestion des médias sociaux tout-en-un.",
    "points": {
      "1": "Utiliser socket.io pour une communication en temps réel avec le serveur",
      "1-1": "Création d'un crochet useChat personnalisé pour une manière plus propre de connecter des composants pour communiquer avec l'état de mise à jour en temps réel",
      "1-2": "Avec l'API contextuelle pour la gestion de l'état",
      "2": "Écrire des tests simples de bout en bout avec cypress",
      "3": "Connexion aux comptes Telegram, WhatsApp et Instagram"
    }
  },
  "etc": {
    "name": "Et ainsi de suite...",
    "description": "Des projets dont je ne suis pas vraiment fier (^_^;)"
  }
}
