[
  {
    "slug": "el-dorado",
    "title": "El Dorado",
    "subtitle": "Two con artists accidentally discover the legendary city of gold in this DreamWorks adventure",
    "description": "Tulio and Miguel, two charming swindlers, stumble upon a map to the mythical city of El Dorado and embark on an adventure that leads them to actual gold. Upon arriving, they're mistaken for gods by the locals and must maintain their deception while dealing with an increasingly complicated situation. Their friendship is tested as they face moral dilemmas, a scheming high priest, and the choice between untold riches and doing what's right.",
    "cover": "/images/favourites/animations/el-dorado.jpg"
  },
  {
    "slug": "ratatouille",
    "title": "Ratatouille",
    "subtitle": "A talented rat pursues his dreams of becoming a chef in a prestigious Parisian restaurant",
    "description": "Remy, a rat with an exceptionally refined palate and passion for cooking, dreams of becoming a chef in Paris despite his family's objections. He forms an unlikely alliance with Linguini, a garbage boy at the famous Gusteau's restaurant, creating a unique partnership where Remy controls Linguini's cooking by pulling his hair. Together they must navigate the challenges of the culinary world while keeping Remy's identity secret, all while dealing with a ruthless food critic and questioning the meaning of true creativity.",
    "cover": "/images/favourites/animations/ratatouille.jpg"
  },
  {
    "slug": "chicken-run",
    "title": "Chicken Run",
    "subtitle": "A group of chickens plot their escape from a farm before being turned into pies",
    "description": "On a Yorkshire chicken farm, Ginger leads countless escape attempts to save her fellow chickens from their eventual fate as pie filling. The arrival of Rocky, a smooth-talking American rooster, brings new hope as he promises to teach the chickens how to fly to freedom. As the farm's owners pivot their business from eggs to chicken pies, the chickens must race against time to execute their most ambitious escape plan yet.",
    "cover": "/images/favourites/animations/chicken-run.jpg"
  },
  {
    "slug": "garfield",
    "title": "Garfield",
    "subtitle": "A lazy, lasagna-loving cat's life is turned upside down when his owner adopts a dog",
    "description": "Garfield, a spoiled and cynical cat who rules his owner Jon's household, faces his biggest challenge when Jon brings home a dim-witted but lovable dog named Odie. Initially plotting to get rid of his new housemate, Garfield must venture outside his comfortable home when Odie is kidnapped by a cruel TV host. The selfish cat learns valuable lessons about friendship and loyalty as he embarks on an unexpected rescue mission.",
    "cover": "/images/favourites/animations/garfield.jpg"
  },
  {
    "slug": "beauty-and-the-beast",
    "title": "Beauty And The Beast",
    "subtitle": "A young woman discovers the true meaning of love while living in an enchanted castle with a cursed prince",
    "description": "Belle, a bright and independent young woman, sacrifices her freedom to save her father by taking his place as prisoner in a mysterious castle. There she discovers the castle's inhabitants have been transformed by a curse, including the Beast - a prince trapped in a monstrous form until he can learn to love and be loved in return. As Belle and the Beast grow closer, they must overcome their differences and external threats, while racing against time to break the spell before it becomes permanent.",
    "cover": "/images/favourites/animations/beauty-and-the-beast.jpg"
  },
  {
    "slug": "up",
    "title": "Up",
    "subtitle": "An elderly widower ties balloons to his house and embarks on an adventure with an unexpected young stowaway",
    "description": "Carl Fredricksen, a 78-year-old balloon salesman, fulfills his lifelong dream of a great adventure by tying thousands of balloons to his house to fly away to South America. His plans are turned upside down when he discovers an eager 8-year-old Wilderness Explorer named Russell has inadvertently become a stowaway. Together, this unlikely pair journeys to a lost world where they encounter talking dogs, an evil explorer, and a rare bird, while learning valuable lessons about friendship and letting go of the past.",
    "cover": "/images/favourites/animations/up.jpg"
  },
  {
    "slug": "sing",
    "title": "Sing",
    "subtitle": "A koala hosts a singing competition to save his theater, bringing together talented animals from all walks of life",
    "description": "Buster Moon, an eternally optimistic koala, attempts to save his struggling theater by hosting a singing competition with a prize that he can't actually afford. His competition attracts an array of animals, each with their own dreams and challenges, including a housewife pig, a teenage gorilla, a punk-rock porcupine, and a shy elephant. As they prepare for the show, each contestant must overcome personal obstacles, while Buster scrambles to keep his theater and his dreams alive.",
    "cover": "/images/favourites/animations/sing.jpg"
  },
  {
    "slug": "the-iron-giant",
    "title": "The Iron Giant",
    "subtitle": "A young boy befriends a giant robot from space in this touching Cold War era story",
    "description": "In 1957 Maine, nine-year-old Hogarth Hughes discovers and befriends a giant alien robot who crashed near his small town. As their friendship grows, Hogarth must help the Giant understand his place in the world while keeping him hidden from suspicious government agents during the height of Cold War paranoia. The story becomes a powerful tale about choice, sacrifice, and what it means to be human, as the Giant must ultimately decide whether to become the weapon he was built to be or the hero he chooses to be.",
    "cover": "/images/favourites/animations/the-iron-giant.jpg"
  },
  {
    "slug": "madagascar",
    "title": "Madagascar",
    "subtitle": "Four pampered zoo animals find themselves stranded on the exotic island of Madagascar",
    "description": "Alex the lion, Marty the zebra, Gloria the hippo, and Melman the giraffe live a comfortable life as the star attractions at New York's Central Park Zoo. When Marty's midlife crisis leads to an escape attempt, their pursuit of him results in all four being shipped off to Africa, only to end up stranded on Madagascar. On the exotic island, these zoo-raised animals must adapt to the wild, face their natural instincts, and learn to survive with the help of a group of crafty penguins and party-loving lemurs.",
    "cover": "/images/favourites/animations/madagascar.jpg"
  },
  {
    "slug": "toy-story",
    "title": "Toy Story",
    "subtitle": "A cowboy doll's position as his owner's favorite toy is jeopardized when a new spaceman figure arrives",
    "description": "Woody, a pull-string cowboy doll, has long been Andy's favorite toy and the leader of Andy's room until the arrival of Buzz Lightyear, a space ranger action figure who believes he's a real space hero. As Woody's position as Andy's favorite toy is threatened, his jealousy leads to both toys becoming lost in the outside world. The two must overcome their rivalry and work together to find their way back home, learning valuable lessons about friendship and self-worth along the way.",
    "cover": "/images/favourites/animations/toy-story.jpg"
  },
  {
    "slug": "kung-fu-panda",
    "title": "Kung Fu Panda",
    "subtitle": "An unlikely panda becomes the chosen one to fulfill an ancient prophecy and defend the Valley of Peace",
    "description": "Po, a clumsy panda working in his father's noodle shop, is unexpectedly chosen as the Dragon Warrior, destined to protect the Valley of Peace. Despite the skepticism of his kung fu heroes, the Furious Five, and their master Shifu, Po must train to become a kung fu master. When an evil kung fu warrior escapes prison and threatens the valley, Po must overcome his self-doubt and prove that he has what it takes to be a true hero.",
    "cover": "/images/favourites/animations/kung-fu-panda.jpg"
  },
  {
    "slug": "shrek",
    "title": "Shrek",
    "subtitle": "An ogre embarks on a quest to rescue a princess and unexpectedly finds love and friendship",
    "description": "Shrek, a grumpy ogre who values his solitude, finds his swamp suddenly invaded by fairy tale creatures banished by Lord Farquaad. To reclaim his home, Shrek strikes a deal with Farquaad to rescue Princess Fiona from a dragon-guarded tower. Accompanied by a talking donkey, Shrek's quest becomes an adventure that challenges everything he believed about himself and others. Along the way, he discovers that true love and friendship can come in unexpected forms, and that beauty is more than skin deep.",
    "cover": "/images/favourites/animations/shrek.jpg"
  },
  {
    "slug": "robots",
    "title": "Robots",
    "subtitle": "A small-town robot inventor heads to Robot City to pursue his dreams and save robot-kind",
    "description": "Rodney Copperbottom, a small-town inventor with big dreams, travels to Robot City hoping to make the world a better place with his inventions. Upon arrival, he discovers that the idealistic corporation he admired has been taken over by a corrupt robot who promotes greed and planned obsolescence. Together with a misfit group of robots, Rodney must fight to save Robot City from a scheme that would force all lower-class robots into scrap metal, while proving that anyone can shine no matter what they're made of.",
    "cover": "/images/favourites/animations/robots.jpg"
  }
]
