{
  "title": "Projekte",
  "points": "Punkte",
  "gallery": "Galerie",
  "nthImage": "Bild {{n}}",
  "octava": {
    "name": "Octava",
    "description": "Persische Musik-Streaming-Plattform",
    "points": {
      "1": "Superschnelles Laden der Seite mit inkrementeller statischer Regeneration (ISR)",
      "2": "Zusätzliche Client-Server-Transportschicht mit HTTP-Proxy",
      "2-1": "Autorisierungstoken als reines HTTP-Cookie speichern",
      "2-2": "Übergeben Sie jede API über den HTTP-Proxy und fügen Sie dem Header ein Token hinzu.",
      "2-3": "Auf diese Weise ist der Zugriff auf Token für böswillige Benutzer viel schwieriger (natürlich nicht unmöglich)",
      "2-4": "Diese Methode ermöglicht es, interessantere und nützlichere Dinge zu tun wie: ",
      "2-4-1": "IP-Adresse verbergen",
      "2-4-2": "Anfragen filtern",
      "2-4-3": "Schutz und Sicherheit",
      "2-4-4": "usw.",
      "3": "Mehrsprachige und themenbezogene Infrastruktur",
      "3-1": "SEO erste mehrsprachige Website",
      "3-2": "Multidirektionale serverseitig gerenderte Website",
      "3-3": "Kein Flash-Thema ändern",
      "3-4": "Benutzerdefinierte Themen definieren",
      "4": "Daten Revalidierung Intervalle auf Client-Seite",
      "5": "Berücksichtigung von SEO Best Practices",
      "5-1": "Meta-Tags optimieren",
      "5-2": "Kanonische Tags definieren, um doppelten Inhalt zu vermeiden",
      "5-3": "Schema-Tag hinzufügen (Rich result) für Medien, Breadcrumbs, ...",
      "6": "Clientseitiges Caching",
      "6-1": "Cache First - Netzwerk-Fallback-Strategie für Layout, Schriftarten, Logos, Avatar und andere wichtige Daten",
      "6-2": "Lesen wichtiger Daten aus dem Cache und falls fehlgeschlagen Fallback auf Netzwerk",
      "6-3": "Rendern einer No-Netzwerkverbindung für vollständig deaktivierte Netzwerkverbindungsfälle",
      "7": "Schnelleres und benutzerfreundlicheres Laden von Bildern mit Bildoptimierungsmethode",
      "7-1": "Laden von Bildern basierend auf den Abmessungen des Bildes und Speichern einer Menge Daten und Zeit",
      "7-2": "Zeigt zunächst eine unscharfe Version des Bildes an, um das Warten auf größere Bilder angenehmer zu gestalten",
      "7-3": "Schimmeranimation für unbekannte Bilder anzeigen, die nicht verwischt werden können",
      "8": "Sichere Codierung mit Front-End-Sicherheitsprüfungen",
      "9": "Mobile App-Benutzererfahrung für PWA-Benutzer mithilfe mobiler nativer Komponenten wie Bottom Sheet, Bottom Tabs Navigator und ..."
    }
  },
  "uneed": {
    "name": "Nicht erforderlich",
    "description": "Eine Plattform zur kostenlosen Veröffentlichung von Anzeigen und Anfragen zum Kauf und Verkauf neuer und gebrauchter Produkte.",
    "points": {
      "1": "Weiter verwenden.js Framework für serverseitiges Rendering",
      "2": "Nach Micro-Frontend-Prinzipien",
      "3": "Lokalisierung und Internationalisierung",
      "4": "Redux Saga als asynchrone Redux-Middleware verwenden",
      "5": "Kombinieren socket.io und Redux, um einen klebrigen Chat zu erstellen, der am unteren Rand des Layouts und einer Chat-Seite schwebt."
    }
  },
  "tarinoo": {
    "name": "Tarinoo",
    "description": "Ein weiteres Produkt von uneed infrastructure, das entwickelt wurde, um vollständig angepasste Websites an geschäftliche Benutzer zu verkaufen.",
    "points": {
      "1": "Code einmal schreiben und auf anderen Sites mit 4 verschiedenen Themen verwenden (bis jetzt)",
      "2": "Volle Kontrolle über Produktdetails, Banner, Inhalte und ..., wie WordPress oder Joomla."
    }
  },
  "bityon": {
    "name": "Bityon",
    "description": "Eine sichere Plattform zum Kaufen und Verkaufen von Bitcoin und anderen Kryptowährungen.",
    "points": {
      "1": "Mehrsprachige und themenbezogene Infrastruktur",
      "1-1": "SEO erste mehrsprachige Website",
      "1-2": "Multidirektionale serverseitig gerenderte Website",
      "1-3": "Kein Flash-Thema ändern",
      "1-4": "Benutzerdefinierte Themen definieren",
      "2": "Verwenden der Kontext-API für die Statusverwaltung (für Daten, die sich nicht häufig ändern, um Leistungsprobleme zu verursachen)",
      "3": "Ersetzen von formik durch react-hook-form für eine bessere Leistung."
    }
  },
  "biz": {
    "name": "UNTERNEHMEN",
    "description": "Das größte iranische Network-Marketing-Unternehmen.",
    "points": {
      "1": "Benutzerdefinierte SSR-Implementierung",
      "2-1": "Manuelles serverseitiges Rendern mit Express",
      "2-2": "Sowohl serverseitige als auch clientseitige Redux-Unterstützung mit synchronisiertem isomorphem Redux-Status",
      "2-3": "SSR-Daten werden vorab abgerufen und als Requisiten an Seiten übergeben",
      "3": "Caching-Anforderungen mit Redis-Schlüssel-Wert-Paar-Datenbank",
      "4": "Benachrichtigungen mit Firebase"
    }
  },
  "crm": {
    "name": "CRM-Bereich",
    "description": "Customer Relationship Management-Panel, das ein All-in-One-Social-Media-Management-Tool bietet.",
    "points": {
      "1": "Verwenden socket.io für Echtzeitkommunikation mit Server",
      "1-1": "Erstellen eines benutzerdefinierten useChat-Hooks für eine sauberere Verbindung von Komponenten zur Kommunikation mit dem Aktualisierungsstatus in Echtzeit",
      "1-2": "Zusammen mit Kontext-API für die Zustandsverwaltung",
      "2": "Einfache Ende-zu-Ende-Tests mit Cypress schreiben",
      "3": "Verbindung zu Telegramm-, WhatsApp- und Instagram-Konten herstellen"
    }
  },
  "etc.": {
    "name": "Und so weiter ...",
    "description": "Projekte, auf die ich nicht wirklich stolz bin ( ^_^;)"
  }
}
