{
  "title": "About Me",
  "video": {
    "title": "Introduction video about Milad Afkhami",
    "desc": "This is a short introduction video for Milad Afkhami to introduce him and his profession"
  },
  "p1": "Hey, I'm Milad. I'm a 23 y.o. developer, mentor, student, and at late nights writer!",
  "p2": "I work at Ide-kavan Co. as front-end chapter lead, I am working in the front-end web development field since my early university years and I'm enjoying every bit of it.",
  "p3": "I grew up in Shahr-e-Rey, a district in the south of Tehran state.",
  "p4": "After spending my elementary and middle school, I got accepted for NODET and spent my high school there.",
  "p5": "After I was ranked 697 on the National entrance exam, I got accepted to study electrical engineering at Shahid Beheshti University",
  "p6": "I really didn't feel good about being an electrical engineer and after a couple of semesters, I changed my field to computer engineering at Islamic Azad University.",
  "p7": "I spend my free time reading, listening to music, watching tv shows, and enjoying time with my close friends.",
  "timeline": {
    "title": "Timeline",
    "born": "born",
    "born_desc": "Born and raised as a single child ... ",
    "earlySchool": "Early School",
    "earlySchool_desc": "when I was 4, I took a test to see if I'm ready for school and I passed it! but I was even smaller than kids my age so my parents decided that I stick to the routine.",
    "startingSchool": "Starting School",
    "startingSchool_desc": "Nothing special to say about this, like every other Iranian kid, I went to a school under a system that kill the creativity and happiness of students.",
    "firstComputer": "First Computer",
    "firstComputer_desc": "My father bought a computer for my 10th birthday, Whoa!",
    "choosingNationalExamPath": "Choosing National entrance exam Path",
    "choosingNationalExamPath_desc": "I was hopelessly in love with Mathematics, I always dreamed my 40 y.o. version to be a bald skinny, not attractive professor who hates kids, but after putting all my efforts and love into learning it, I decided to concentrate on the national entrance exam.",
    "university": "University",
    "university_desc": "Endeavor paid off! I got accepted to study electrical engineering at Shahid Beheshti University, couldn't be happier but ...",
    "tookCoupleOfSemestersOff": "Took Couple Semesters Off",
    "tookCoupleOfSemestersOff_desc": "I took a couple of semesters off to work on companies and professional teams.",
    "changingField": "Changing Field",
    "changingField_desc": "After one year of flip-flopping, I decided to change my field of study to computer engineering. I can't forget the hell my parents raised because of my decision.",
    "firstDayAtWork": "First Day At Work",
    "firstDayAtWork_desc": "As a night owl, I had a firm reason to hate that day and the days ahead, but my love for learning and competing, helped me keep going.",
    "growingMyHair": "This is when I started to grow my hair :)",
    "growingMyHair_desc": "",
    "leftMyFirstJob": "Left My First Job",
    "leftMyFirstJob_desc": "As time goes by, I realized it wasn't really anything to learn for me in that company, so I officially quit my first job",
    "startingAtAppTech": "Starting At AppTech",
    "startingAtAppTech_desc": "I found a good company to experience new challenges. I improved my React knowledge there and learned React Native.",
    "startingAtArshCo": "Starting At Arsh Co.",
    "startingAtArshCo_desc": "After reaching a good knowledge of React, I decided to have a new challenge and work on larger projects and I chose Arsh Company to continue. despite my last superiors, they were really nice to me",
    "becomingChapterLead": "Becoming Chapter Lead",
    "becomingChapterLead_desc": "I proved myself to headquarters in my challenges and became lead of the front-end development chapter.",
    "ielts": "IELTS",
    "ielts_desc": "I passed my IELTS exam with a 7 score.",
    "startingAtBehtarino": "Starting at Behtarino Team - Ide-kavan Co.",
    "startingAtBehtarino_desc": "After overcoming numerous big challenges in Arsh corporation, decided to leave the company for good regarding the lack of suitability between my abilities and expertises and their necessities.\nAs I preferred to work creatively employing multi-expertises, decided not to work with large companies though had satisfying offers.\nAs a result, I started working with Behtarino team at Ide-Kavan Company, a young Iranian startup, so can challenge myself by owning the recoding project of their websites's front-end.",
    "becomingChapterLeadAtIdeKavan": "Becoming Chapter Lead at Ide-Kavan(Owner of the Behtarino team)",
    "becomingChapterLeadAtIdeKavan_desc": "Five months after I joined Behtarino team, I overcame to my starter challenge of recoding the whole behtarino website to reach sustainability and became front-end chapter lead at the company level(Ide-Kavan company).\nMy goal was to help the company bringing sustainability for other projects and help ~10 members of front-end chapter to level up everyday."
  },
  "workExperience": {
    "title": "Work Experience",
    "1": "Front-End Developer",
    "1_desc": "Freelance",
    "2": "Front-End Developer",
    "2_desc": "Silverpath - Tehran - ~30 employee\n",
    "3": "Front-End Developer",
    "3_desc": "App Tech - Tehran - ~30 employee\n",
    "4": "Front-End Chapter Lead",
    "4_desc": "Arsh - Tehran - ~50 employee\n",
    "5": "Front-End Chapter Lead",
    "5_desc": "Ide-Kavan - Tehran - ~150 employee\n"
  },
  "education": {
    "title": "Education",
    "1": "Electrical Engineering",
    "1_desc": "Shahid Beheshti University, GPA: B",
    "2": "Computer Engineering",
    "2_desc": "Islamic Azad University, GPA: A+"
  }
}
