{
  "title": "Projects",
  "points": "Points",
  "tools": "Tools",
  "gallery": "Gallery",
  "description": "Description",
  "reval": {
    "name": "Reval",
    "shortDescription": "Web application marketplace designed exclusively for SMBs(Small and medium-sized Businesses)",
    "description": "Web application marketplace designed exclusively for SMBs(Small and medium-sized Businesses), Featuring a Microfrontend architecture with Webpack Module Federation, ensuring enhanced flexibility and performance. The platform facilitates seamless communication between Microfrontends through the implementation of a standard event bus, eliminating the need for complex state management.",
    "points": {
      "1": "Using webpack module federation to implement Microfrontend architecture with enhanced flexibility and performance",
      "2": "Facilitating seamless communication between Microfrontends through the implementation of a standard event bus, eliminating the need for complex state management",
      "3": "Utilizing SWC to boost extensibility and performance through development and production environments",
      "4": "Composing comprehensive documentation using storybook, Gitlab Wiki, Markdown, and XMind"
    }
  },
  "xsystem-toolkit": {
    "name": "Toolkit",
    "shortDescription": "Organization front-end infrastructure team",
    "description": "Three NPM packages encompassing UI Kits, Hooks, and Utils, harnessing the capabilities of NPM packages to elevate frontend development, mitigate inconsistency, and eradicate redundancy and duplication across the organization.",
    "points": {
      "1": "Using webpack module federation to implement Microfrontend architecture with enhanced flexibility and performance",
      "2": "Using React query for in-app server state management",
      "3": "Using Zustand for in-app UI state management"
    }
  },
  "landingator": {
    "name": "Landingator",
    "shortDescription": "Dynamic website builder",
    "description": "Dynamic website builder with superfast and also up-to-date static pages using on-demand revalidation, comprehensive documentation, and advanced developer experience.",
    "points": {
      "1": "Fast page load with incremental static regeneration ( ISR )",
      "2": "Up-to-date static pages with on-demand revalidation",
      "3": "Composing comprehensive documentation using storybook, Gitlab Wiki, Markdown, and XMind",
      "4": "Advanced developer experience using bash script for operations like dev, build, test and ...",
      "5": "Build-time generated stylesheets like tailwind, using scripts written in mjs",
      "6": "Considering SEO best practices",
      "6-1": "Optimizing meta tags",
      "6-2": "Defining canonical tags to avoid duplicate content",
      "6-3": "Adding schema tag ( rich result ) for blogs, faqs, businesses, breadcrumbs, ..."
    }
  },
  "behtarino": {
    "name": "Behtarino",
    "shortDescription": "A platform for introducing and reviewing businesses in Iran",
    "description": "With more than 5 million views per month, Behtarino is considered one of the largest(Yelp-ish) platforms for introducing and reviewing businesses in Iran.",
    "points": {
      "1": "Using Mapbox to work with interesting map features in web",
      "2": "Using TWA (Trusted Web Activities) to generate a mobile app for our PWA",
      "3": "Fast page load with incremental static regeneration ( ISR )",
      "4": "Mobile App User experience for PWA users by using mobile native components like a bottom sheet, pop-up view, bottom tabs navigator, and ...",
      "5": "Considering SEO best practices",
      "5-1": "Optimizing meta tags",
      "5-2": "Defining canonical tags to avoid duplicate content",
      "5-3": "Adding schema tag ( rich result ) for media, breadcrumbs, ..."
    }
  },
  "octava": {
    "name": "Octava",
    "shortDescription": "Fully-featured persian music streaming platform",
    "description": "Fully-featured persian music streaming platform.",
    "points": {
      "1": "Superfast page load with incremental static regeneration ( ISR )",
      "2": "Extra client-server transport layer with HTTP proxy",
      "2-1": "Saving authorization token as an http-only cookie",
      "2-2": "Pass every API through the HTTP proxy and add the auth token to header",
      "2-3": "This way accessing token is a lot harder for malicious users (not impossible of course)",
      "2-4": "This method makes it possible to do more interesting and useful pieces of stuff like : ",
      "2-4-1": "Hiding An IP Address",
      "2-4-2": "Filtering Requests",
      "2-4-3": "Protection And Security",
      "2-4-4": "etc.",
      "3": "Multi-language and multi-theme infrastructure",
      "3-1": "SEO first multi-language website",
      "3-2": "Multi-directional server-side rendered website",
      "3-3": "No flash theme change",
      "3-4": "Define custom themes",
      "4": "Data revalidation intervals on client-side",
      "5": "Considering SEO best practices",
      "5-1": "Optimizing meta tags",
      "5-2": "Defining canonical tags to avoid duplicate content",
      "5-3": "Adding schema tag ( rich result ) for media, breadcrumbs, ...",
      "6": "Client-side caching",
      "6-1": "Cache first - Network fallback strategy for layout, fonts, logos, avatar and other important data",
      "6-2": "Reading important data from cache and if failed fallback to network",
      "6-3": "Rendering a no network connection for completely disabled network connection cases",
      "7": "Faster and more user-friendly image load with the image optimization method",
      "7-1": "Loading images based on dimensions of the image and saving a lot of data and time",
      "7-2": "Showing a blurred version of the image at first makes waiting for larger images a lot more pleasant",
      "7-3": "Showing shimmer animation for unknown images that can't be blurred",
      "8": "Secure coding with front-end security checks",
      "9": "Mobile App User experience for PWA users by using mobile native components like a bottom sheet, bottom tabs navigator, and ..."
    }
  },
  "uneed": {
    "name": "Uneed",
    "shortDescription": "Free advertisement posting platform",
    "description": "A platform for free posting of advertisements and inquiries regarding the purchase and sale of new and used products.",
    "points": {
      "1": "Using Next.js framework for server-side rendering",
      "2": "Following Micro Frontend principles",
      "3": "Localization and Internationalization",
      "4": "Using redux-saga as a redux async middleware",
      "5": "Combining socket.io and redux to create a sticky chat floating on the bottom of the layout and a chat page."
    }
  },
  "tarinoo": {
    "name": "Tarinoo",
    "shortDescription": "Fully customizable store and site builder for SMBs",
    "description": "Another product of uneed infrastructure, Tarinoo is a fully customizable store and site builder that handles end-to-end of B2C and B2B SMBs(Small and Medium-Sized Businesses) digital needs, including inventory and warehouse management, shipping, online payment gateway, CRM(Customer Relationship Management), and etc.",
    "points": {
      "1": "Writing code once and using it in other sites with 4 different themes (till now)",
      "2": "Full control over product details, banners, contents and ..., like WordPress and Joomla."
    }
  },
  "bityon": {
    "name": "Bityon",
    "shortDescription": "A secure platform to trade crypto currencies",
    "description": "A secure platform to buy and sell bitcoin and other crypto currencies.",
    "points": {
      "1": "Multi-language and multi-theme infrastructure",
      "1-1": "SEO first multi-language website",
      "1-2": "Multi-directional server-side rendered website",
      "1-3": "No flash theme change",
      "1-4": "Define custom themes",
      "2": "Using Context API for state management (for data that isn't changing frequently to cause performance issues)",
      "3": "Replacing formik with react-hook-form for better performance."
    }
  },
  "biz": {
    "name": "BIZ",
    "shortDescription": "The biggest iranian network marketing company",
    "description": "The biggest iranian network marketing company.",
    "points": {
      "1": "Custom SSR implementation",
      "2-1": "Manual server-side rendering with express",
      "2-2": "Both server-side and client-side redux support with synced isomorphic redux state",
      "2-3": "SSR data prefetching and passing it to pages as props",
      "3": "Caching requests with Redis key-value pair database",
      "4": "Notifications with firebase"
    }
  },
  "crm": {
    "name": "CRM Panel",
    "description": "Customer relationship management panel that provides an all-in-one social media management tool.",
    "points": {
      "1": "Using socket.io for real-time communication with the server",
      "1-1": "Building a custom useChat hook for a cleaner way to connect components to communicate with real-time updating state",
      "1-2": "Along with context API for state management",
      "2": "Writing simple end to end tests with cypress",
      "3": "Connecting to Telegram, WhatsApp, and Instagram accounts"
    }
  },
  "etc": {
    "name": "And so forth ...",
    "description": "Projects that I'm not really proud of ( ^_^;)"
  }
}
